---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightTable.Remove(Autodesk.Revit.DB.ExportLineweightKey)
zh: 删除、移除
source: html/bfc77379-e274-972c-edb1-88b60aea92f4.htm
---
# Autodesk.Revit.DB.ExportLineweightTable.Remove Method

**中文**: 删除、移除

Removes the pair (key, info) corresponding to the given ExportLineweightKey.

## Syntax (C#)
```csharp
public void Remove(
	ExportLineweightKey exportLineweightKey
)
```

## Parameters
- **exportLineweightKey** (`Autodesk.Revit.DB.ExportLineweightKey`) - The export line weight key

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null